USE [sedc]
GO
/*
	ВАЖНО:
	1) ВЛЕЗНИТЕ ПАРАМЕТРИ ДОКОЛКУ ИМААТ ВРЕДНОСТ ПОСЛЕ ДЕФИНИЦИЈАТА ТАА Е DEFAULТ-на,
		ПА АКО НЕ ПРОСЛЕДИМЕ ПАРАМЕТАР ВО ПОВИКОТ, ТАА ЌЕ СЕ ЗЕМЕ СЕКОГАШ ЗА ТОЈ ПАРАМЕТАР
		- ЧЕСТО СЕ УПОТРЕБУВА ЗА ДАТУМИ
	2) КОГА СЕ КРЕИРА ПРОЦЕДУРА ТРЕБА ДА СЕ ВНИМАВА ВО ПРОЗОРЕЦОТ (СЕСИЈАТА) ДА НЕ СЕ ОСТАВА ДРУГ КОД (ЗА ТЕСТИРАЊЕ И СЛИЧНО)
		ИЛИ ОБАВЕЗНО ПОСЛЕ END ДА СЕ ДОДАДЕ "GO" СО ШТО КРЕИРАЊЕТО ИЛИ АЛТЕРИРАЊЕТО БИ СЕ ИЗВРШИЛО ДО ТАМУ
		-ОВА ЗНАЕ ЧЕСТО ДА СЕ СЛУЧУВА КАКО ГРЕШКА
	3) ПОСТОЈАТ РАЗЛИЧНИ НАЧИНИ ДА СЕ ПОВИКА ПРОЦЕДУРА
		- МОЖЕ ДА НЕМА ВЛЕЗНИ ПАРАМЕТРИ ДОКОЛКУ НАВИСТИНА Е БЕЗ ПАРАМЕТРИ ИЛИ ДОКОЛКУ ИМААТ DEFAULT ВРЕДНОСТ
		- МОЖЕ ДА СЕ ПОВИКУВА САМО СО ВНЕС НА ВЛЕЗНИТЕ ПАРАМЕТРИ КОИ НЕМААТ DEFAULT ВРЕДНОСТ
		- МОЖЕ ДА СЕ ПОВИКУВА СО ИМЕТО НА ВЛЕЗНИОТ ПАРАМЕТАР И ВРЕДНОСТА ИЛИ САМО СО ВРЕДНОСТА
*/



CREATE OR ALTER PROCEDURE Test_Default  
	@First as int=0,
	@second as int =1
AS
BEGIN
	PRINT 'First' 
	PRINT  @First
	PRINT 'Second'
	PRINT  @Second
END
--GO

-- Different ways of executing the procedure
EXEC Test_Default
EXEC Test_Default @First=1
EXEC Test_Default @second =10
EXEC Test_Default 10,20
EXEC Test_Default @second=50, @First=100
